// Задача 1.
// Создайте переменные с корректными именами, чтобы сохранить следующую информацию:
// 1. firstName – имя (строка)
// 2. lastName – фамилия (строка)
// 3. isStudent – является ли учеником курса (булево значение)

// Задача 2.
// 1. Объявите переменную age с числовым значением возраста студента.
// 2. Объявите переменную currentYear и присвойте ей значение текущего года (например, 2025).
// 3. Используя age и currentYear вычислите год рождения студента, запишите результат в переменную birthYear.

// Задача 3.
// Выведите в консоли сообщение в таком формате:
// Меня зовут [Александр] [Тарасенко], мне [28] лет. Я ученик/ученица курса: [Арокен.ру].

// Задача 4.
// Какое значение будет у переменной result?
// let a = '123';
// let b = +'456';
// let c = Number('789');
// let d = Boolean(0);
// let e = Boolean(' ');
// let result = a + b + c + d + e;

// ===== Задача 1 =====
let firstName = "Александр";
let lastName = "Тарасенко";
let isStudent = true;

// ===== Задача 2 =====
let age = 28;
let currentYear = 2025;
let birthYear = currentYear - age;

// ===== Задача 3 =====
let courseName = "isStudent";

console.log(
	`Меня зовут ${firstName} ${lastName}, мне ${age} лет. Я ученик/ученица курса: ${courseName}.`,
);

// ===== Задача 4 =====
let a = "123";
let b = +"456";
let c = Number("789");
let d = Boolean(0);
let e = Boolean(" ");
let result = a + b + c + d + e;

console.log(result);
